package exam;

public class examnamebean {
	public String typetoname(int EX_TYPE) {
		String name ="";
		
		String[] exam = {"가스기사","정보처리기사","가구제작기능사","가맹거래사","가스기능사","가스기능장"
		             	,"가스산업기사","건설기계설비기사","건설기계설비산업기사","건설기계정비기능사","건설기계정비기능장","건설기계정비산업기사","건설안전기사"
		            	,"건설안전산업기사","건설재료시험기능사","건설재료시험기사","건설재료시험산업기사","건축기사","건축목공산업기사","건축목재시공기능장"
		            	,"건축산업기사","건축설비기사","건축설비산업기사","건축일반시공기능장","건축일반시공산업기사","공유압기능사","공조냉동기계기능사"
		            	,"공조냉동기계기사","공조냉동기계산업기사","광고도장기능사","광학기능사","광학기사","교통기사","교통산업기사"
		            	,"굴삭기운전기능사","귀금속가공기능사","귀금속가공기능장","귀금속가공산업기사","금속도장기능사","금속재료기능장","금속재료기사"
		            	,"금속재료산업기사","금속재료시험기능사","금형기능사","금형제작기능장","기계가공기능장","기계가공조립기능사","기계설계기사"
		            	,"기계설계산업기사","기계정비기능사","기계정비산업기사","기계조립산업기사","기상기사","네트워크관리사1급","네트워크관리사2급"
		            	,"농기계운전기능사","농기계정비기능사","농림토양평가관리산업기사","농산물품질관리사1차","농업기계기사","농업기계산업기사","농작업안전보건기사"
		            	,"누설비파괴검사기사","대기환경기사","대기환경산업기사","도시계획기사","도자기공예기능사","동력기계정비기능사","멀티미디어콘텐츠제작전문가"
		            	,"모터그레이더운전기능사","목공예기능사","무선설비기능사","무선설비기사","무선설비산업기사","물류관리사1교시","물류관리사2교시"
		            	,"미용사(네일)","미용사(일반)","미용사(피부)","미용장","바이오화학제품제조기사","반도체설계산업기사","방사선비파괴검사기능사"
		            	,"배관기능장","버섯종균기능사","보석가공기능사","사무자동화산업기사","사진기능사","사출(프레스)금형산업기사","사출(프레스)금형설계기사"
		            	,"산림기능사","산림기사","산림산업기사","산업보건지도사","산업안전기사","산업안전산업기사","산업안전지도사"
		            	,"산업위생관리기사","산업위생관리산업기사","생물분류기사(동물)","생물분류기사(식물)","생산자동화기능사","생산자동화산업기사","석공예기능사"
		            	,"선체건조기능사","설비보전기능사","설비보전기사","섬유디자인산업기사","세탁기능사","소방설비기사(기계분야)","소방설비기사(전기분야)"
		            	,"소방설비산업기사(기계)","수산양식기사","승강기기사","식육가공기사","방송통신산업기사","방수산업기사","배관기능사"
		            	,"소방설비산업기사(전기)","수산양식산업기사","승강기산업기사","식품가공기능사","에너지관리산업기사","연삭기능사","에너지관리기사"
		            	,"소방시설관리사","수산제조기사","시각디자인기사","신재생에너지발전설비기능사","식품기사","압연기능장","에너지관리기능장"
		            	,"소음진동기사","수질환경기사","시각디자인산업기사","신재생에너지발전설비기사","식품산업기사","양복기능사","에너지관리기능사"
		            	,"소음진동산업기사","수질환경산업기사","시설원예기사","신발류제조기능사","압연기능사","양장기능사","열처리기능사"
		            	,"손해평가사","스포츠경영관리사","식물보호기사","신재생에너지발전설비산업기사","실내건축산업기사","양화장치운전기능사","염색기능사"
		            	,"수산양식기능사","승강기기능사","식물보호산업기사","실내건축기능사","실내건축기사","어로산업기사","영사기능사"
		            	,"온실가스관리기사","와전류비파괴검사기사","용접기능사","용접기능장","용접기사","용접산업기사","원예기능사","원자력기사"
		            	,"원형기능사","웹디자인기능사","위험물기능사","위험물기능장","위험물산업기사","유기농업기능사","유기농업기사","유기농업산업기사"
		            	,"응용지질기사","의공기사","의공산업기사","의료전자기능사","의류기사","이용사","이용장","인간공학기사"
		            	,"인쇄기능사","인쇄기사","인쇄산업기사","일반기계기사","임산가공기능사","임산가공기사","임산가공산업기사","임업종묘기능사"
		            	,"임업종묘기사","자기비파괴검사기능사","자기비파괴검사기사","자기비파괴검사산업기사","자동차보수도장기능사","자동차정비기능사","자동차정비기능장","자동차정비기사"
		            	,"자동차정비산업기사","자동차차체수리기능사","자연생태복원기사","자연생태복원산업기사","잠수기능사","잠수산업기사","전기공사기사","전기공사산업기사"
		            	,"전기기능사","전기기능장","전기기사","전기산업기사","전기철도기사","전기철도산업기사","전산응용건축제도기능사","전산응용기계제도기능사"
		            	,"전산응용조선제도기능사","전산응용토목제도기능사","전자계산기기능사","전자계산기기사","전자계산기제어산업기사","전자계산기조직응용기사","전자기기기능사","전자기기기능장"
		            	,"전자기사","전자부품장착기능사","전자산업기사","전자상거래운용사","전자출판기능사","전자캐드기능사","전파전자통신기능사","전파전자통신기사"
		            	,"정밀측정기능사","정밀측정산업기사","정보기기운용기능사","정보보안기사","정보처리기능사","정보처리산업기사","정보통신기사","정보통신산업기사"
		            	,"제강기능장","제과기능사","제과기능장","제빵기능사","제선기능사","제선기능장","제품디자인기사","제품디자인산업기사"
		            	,"제품응용모델링기능사","조경기능사","조경기사","조경산업기사","조리기능장","조선기사","조선산업기사","조주기능사"
		            	,"종자기능사","종자기사","종자산업기사","주조기능사","주조기능장","주조산업기사","지게차운전기능사","지적기능사"
		            	,"지적기사","지적산업기사","천장크레인운전기능사","철도신호기사","철도신호산업기사","철도운송산업기사","철도차량기사","철도차량정비기능장"
		            	,"철도토목기능사","철도토목산업기사","초음파비파괴검사기능사","초음파비파괴검사기사","초음파비파괴검사산업기사","초음파비파괴검사","축로기능사","축산기능사"
		            	,"축산기사","축산산업기사","측량기능사","측량및지형공간정보기사","측량및지형공간정보산업기사","치공구설계산업기사","침투비파괴검사기능사"
		            	,"침투비파괴검사기사","침투비파괴검사산업기사","컨테이너크레인운전기능사","컬러리스트기사","컬러리스트산업기사","컴퓨터그래픽스운용기능사","컴퓨터응용가공산업기사"
		            	,"컴퓨터응용밀링기능사","컴퓨터응용선반기능사","콘크리트기능사","콘크리트기사","콘크리트산업기사","타워크레인운전기능사","텔레마케팅관리사토목기사"
		            	,"토목산업기사","토양환경기사","통신기기기능사","통신선로기능사","통신선로산업기사","통신설비기능장","특수용접기능사"
		            	,"판금제관기능장","판금제관산업기사","패션디자인산업기사","패션머천다이징산업기사","폐기물처리기사","폐기물처리산업기사","포장기사"
		            	,"포장산업기사","표면처리기능사","표면처리기능장","표면처리산업기사","품질경영기사","품질경영산업기사","플라스틱창호기능사"
		            	,"피아노조율기능사","피아노조율산업기사","한국사능력검정시험기본","한국사능력검정시험심화","한국수어교원자격검정","한복기능사","한복산업기사"
		            	,"한식조리기능사","항공기관정비기능사","항공기사","항공기체정비기능사","항공무선통신사","항공산업기사","항공장비정비기능사"
		            	,"항공전자정비기능사","항로표지기능사","항로표지기사","항로표지산업기사","해양공학기사","해양자원개발기사","해양조사산업기사"
		            	,"해양환경기사","화공기사","화약류관리기사","화약류관리산업기사","화약취급기능사","화재감식평가기사","화재감식평가산업기사"
		            	,"화학분석기능사","화학분석기사","화훼장식기능사","화훼장식기사","환경기능사"};
		
		name = exam[EX_TYPE-1];
		
		return name;
	}
}
